import React, {Component} from 'react';
import styles from './styles.module.css';

function Disclaimer() {
  return (
    <div class={styles.disclaimer_box}>
      <h3>免责声明</h3>
      <h4>总则</h4>
      <p>
        英荔播课（BroadClass）的产品及服务（以下简称「英荔播课服务」）由广东英荔国际教育科技有限公司（以下简称「英荔」、「英荔播课」或「我们」）提供。本免责声明（以下简称「本声明」）适用于我们向您提供的所有服务，无论您是通过英荔播课的网站（https://www.yingliboke.cn），还是通过在计算机设备、移动终端或其他设备上的客户端、应用程序获得。为保障您的合法权益，英荔用户（以下简称「您」或「用户」）在接受英荔播课服务之前，
        <b>
          请务必仔细阅读本条款并同意本声明。其中，重要内容将以加粗形式提示您注意，您应重点阅读。
        </b>
      </p>
      <p>
        您直接或通过各类方式（如站外 API
        引用等）间接使用英荔播课服务和数据的行为，都将被视作已无条件接受本声明所涉全部内容；若您对本声明的任何条款有异议，请停止使用英荔所提供的全部服务。
      </p>
      <p>
        本免责声明可由英荔随时修正或更改，英荔将公布并更新生效日期。更新后的免责声明一旦公布即有效代替原来的声明，您继续使用英荔播课服务即表示您同意并接受本声明及其任何更新版本。
      </p>
      <h4>第一条</h4>
      <p>
        您以各种方式使用英荔播课服务和数据（包括但不限于发表文字、图片，浏览及利用英荔播课或其用户发布的内容）的过程中，
        <b>
          不得以任何方式利用英荔直接或间接从事违反中华人民共和国法律法规，以及社会公德的行为。您应当恪守下述承诺：
        </b>
      </p>
      <p>1. 不得干扰、损害和侵犯英荔的各种合法权利与利益；</p>
      <p>2. 不得干扰、损害和侵犯其他英荔用户的各种合法权利与利益；</p>
      <p>3. 遵守英荔以及与之相关的网络服务的协议、指导原则、管理细则等；</p>
      <p>4. 英荔有权对违反上述承诺的内容予以删除。</p>
      <h4>第二条</h4>
      <p>
        1.
        英荔仅为用户发布的内容提供存储空间，英荔不对用户发表、转载的内容提供任何形式的保证：不保证内容满足用户的要求，不保证英荔的服务不会中断。
        <b>
          因网络状况、通讯线路、第三方网站或管理部门的要求等任何原因而导致用户不能正常使用本网站，英荔不承担任何法律责任。
        </b>
      </p>
      <p>
        2.{' '}
        <b>
          您在使用英荔播课服务过程中与任何第三方所产生的纠纷与经济、法律责任需自担，均与英荔无关。
        </b>
      </p>
      <p>
        3. 我们
        <b>
          有权定期或不定期对英荔播课平台（如网站）或相关设备进行检修、维护、升级等，如因此类情况造成英荔播课服务在合理时间内中断或暂停，我们无须为此承担任何法律责任，
        </b>
        但我们应当尽量以提前公告（包括但不限于网站公告、系统通知等）、在非高峰时段操作等形式减少对您的影响。
      </p>
      <p>
        4.
        您在英荔播课平台上发表的内容仅表明其个人的立场和观点，并不代表我们的立场或观点。
        <b>
          作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由您本人承担全部法律及连带责任。
        </b>
        英荔不承担任何法律及连带责任。
      </p>
      <p>
        5.
        您在英荔播课平台发布的涉嫌侵犯他人知识产权或其他合法权益的内容，经相关方提供初步证据，英荔有权先行予以删除，并保留移交司法机关查处的权利。参照相应司法机关的查处结果，英荔对于发布内容的处置具有最终决定权。
      </p>
      <p>
        6. <b>英荔对本免责声明享有最终解释权。</b>
        请您在发现任何违反本声明以及其他任何条款、英荔各类公告之情形时，通知我们。如您对本声明、产品或服务有任何意见、建议或疑问，欢迎通过以下方式向我们反馈。
      </p>
      <ul>
        <li>电话：400-931-8118（周一至周五 9:00 - 18:00）</li>
        <li>邮箱：support@yingliboke.cn</li>
        <li>地址：广州市天河区天河北路 233 号中信广场写字楼 1005 室</li>
        <li>邮政编码：510620</li>
      </ul>
      <br />
      <p>本免责声明生效日期：2019 年 12 月 23 日</p>
    </div>
  );
}

export default Disclaimer;
