import React, {Component} from 'react';
import {Form} from 'antd';
import styles from './styles.module.css';

function AccountLogoff() {
  return (
    <div className={styles.about_us_box}>
      <h3>英荔播课账号注销协议</h3>
      <p>
        【重要说明】在您正式开始下一步英荔播课账号注销流程前，我们为您做出如下特别说明：注销英荔播课账号（以下简称「账号」）后，您将无法再以此账号登录和使用广东英荔国际教育科技有限公司（以下简称「英荔」、「英荔播课」或「我们」）的相关产品与服务（以下简称「英荔播课服务」），且账号一旦注销完成，将无法恢复。请您在注销前慎重考虑。
      </p>
      <p>
        若您经过慎重考虑后仍执意决定注销账号，请您务必先仔细阅读和充分理解本《英荔播课账号注销协议》（以下简称「本注销协议」）。
        <b>
          您同意并勾选本注销协议及点击下一步注销操作的行为即视为您已充分阅读、理解并接受本注销协议的全部内容。在阅读本注销协议的过程中，若您不同意相关任何条款，请您立即停止账号注销程序。
        </b>
        如您在注销后需要再次使用英荔播课服务，欢迎您使用手机号或英荔允许的其他方式重新注册。同时，如您对本注销协议有任何疑问，或对英荔播课服务体验有任何建议，欢迎发邮件至
        support@yingliboke.cn
        联系或反馈给我们，以便我们进一步改进和完善我们的产品和服务。
      </p>
      <h4>一、注销须知</h4>
      <p>
        1.{' '}
        <b>
          您所申请注销的英荔播课账号应当是您本人依照英荔播课的《用户协议》的约定注册的账号。
        </b>
        您应当依照英荔规定的程序或操作提示进行账号注销。
      </p>
      <p>
        2.{' '}
        <b>
          注销前，请先行检查并确保您的账号满足以下条件，否则我们有权驳回您的账号注销申请：
        </b>
      </p>
      <ul>
        <li>
          账号处于安全状态，最近一个月内无修改密码、更换关联手机/邮箱、绑定手机/邮箱记录；
        </li>
        <li>最近一个月内无提交账号注销申请操作；</li>
        <li>账号内无剩余资金或未完成的交易/服务。</li>
      </ul>
      <p>
        3.{' '}
        <b>
          您应确保您有权决定该帐号的注销事宜，不侵犯任何第三方的合法权益，如因此引发任何争议，由您自行承担。
        </b>
      </p>
      <p>
        4. <b>英荔播课账号一旦注销，将无法恢复，</b>
        即使您使用相同的手机号码再次注册并使用英荔播课服务。因此，在申请账号注销前，请确保与该账号相关的所有交易及服务均已进行妥善处理。请自行备份英荔播课账号中您所需的相关信息和数据（包括但不限于订单信息、直播报告/报表数据和服务交易记录等资料）。
      </p>
      <p>
        5.{' '}
        <b>
          注销一旦完成，您将无法再使用该账号，您曾通过该账号登录、使用的英荔播课服务下的所有内容、信息、数据、记录将会被删除或匿名化处理，您也无法再检索、访问、获取、继续使用和找回，也无权要求我们找回
        </b>
        （法律法规另有规定或监管部门另有要求的除外），包括但不限于：
      </p>
      <ul>
        <li>
          该账号下的个人资料（如：头像、昵称等）及绑定信息（如：绑定手机号、邮箱等）；
        </li>
        <li>该账号下的您的个人信息；</li>
        <li>
          该账号曾发表的所有内容（如：视频、文档、图片、照片、评论、互动等）；
        </li>
        <li>其他所有内容、信息、数据、记录。</li>
      </ul>
      <p>
        6.{' '}
        <b>
          您的账号注销行为表明您自愿、主动放弃该账号在英荔播课服务使用期间已产生的但未消耗完毕的权益，同时对于该账号可能产生的如下结果及由此产生的一切纠纷，由您自行承担
          ：
        </b>
      </p>
      <ul>
        <li>无法继续使用该帐号进行登录；</li>
        <li>您尚未到期且尚未使用的直播场次将作废，且相关费用不予退回；</li>
        <li>您账号内充值的金额将清零或作废，且无法恢复； </li>
        <li>
          您账号上传到平台内所有的资料（如：视频、文档、图片等）将被删除清空，且无法恢复；
        </li>
        <li>
          您账号内所产生的所有直播场次数据、报告及报表将被删除清空，且无法恢复。
        </li>
      </ul>
      <p>
        7.
        账号一旦注销，您与我们曾签署过的相关用户协议、其他权利义务性文件等相应终止（但我们与您之间已约定继续生效的或法律法规另有规定的除外）。
      </p>
      <p>
        8.{' '}
        <b>
          在帐号注销期间，如果您的帐号被他人投诉、被国家机关调查或者正处于诉讼、仲裁程序中，我们有权自行终止您的帐号注销程序，而无需另行得到您的同意。
        </b>
      </p>
      <p>
        9.{' '}
        <b>
          注销您的帐号并不代表本帐号注销前的帐号行为和相关责任得到豁免或减轻。
        </b>
      </p>
      <h4>二、注销流程</h4>
      <p>
        1. 您可通过移动端「英荔播课」 App（注销功能路径为：我的 - 设置 -
        更多设置 -
        账号注销）的在线注销功能，按照页面操作指引进行在线账号注销申请。也可直接与我们联系进行账号注销。
      </p>
      <p>
        2. <b>为保障您的账号安全和财产权益，我们需要进行注销申请的身份验证</b>
        （如：验证账号绑定的手机号等），以确保该账号为您本人所注册，且注销申请为您本人提交。
      </p>
      <p>
        3.{' '}
        <b>
          账号注销的处理期限为 7 日，即在您成功提交英荔播课账号注销申请后的 7
          日内（从成功提交申请之时起算），账号将被注销（本注销协议另有约定的除外）。
        </b>
        在前述 7
        日内且注销尚未被处理期间，您可正常使用该账号。若此期间您想撤销账号注销申请，可在相关页面上撤销申请（路径：我的
        - 设置 - 更多设置 - 账号注销 - 撤销申请）。
      </p>
      <p>
        4. 如超过上述第 3 点的 7
        天期限，我们未收到您撤销申请的请求，该账号将被永久注销。
      </p>
      <p>5. 本注销协议未尽之事宜，请参照英荔播课的《用户协议》执行。</p>
      <p>本注销协议生效日期：2020 年 03 月 12 日</p>
    </div>
  );
}

export default AccountLogoff;
